BOJ_RESULT = {
    # Processing
    # "기다리는 중": "채점이 밀려서 아직 채점이 되지 않은 상태입니다. 조금만 기다려 보세요.",
    # "재채점을 기다리는 중": "재채점을 기다리는 중입니다.",
    # "컴파일 하는 중": "컴파일 하는 중입니다.",
    # "채점중": "채점을 하는 중입니다.",
    # Result
    "맞았습니다!!": "제출한 프로그램이 모든 테스트 케이스를 통과했을 때 입니다. 즉, 정답입니다!",
    "출력 형식이 잘못되었습니다": "출력 결과는 정답과 유사하나, 공백, 빈 줄과 같은 문제로 인해서 출력 결과가 일치하지 않은 경우 입니다.",
    "틀렸습니다": "출력 결과가 정답과 다른 경우 입니다.",
    "시간 초과": "프로그램이 제한된 시간이내에 끝나지 않은 경우입니다. 이런 경우에는 채점을 중간에 중단하므로, 정답이 맞는지 아닌지는 알 수가 없습니다.",
    "메모리 초과": "프로그램이 허용된 메모리보다 많은 메모리를 사용했을 경우입니다.",
    "출력 초과": "너무 많은 출력이 발생하는 경우입니다. 주로 프로그램이 무한 루프에 빠졌을 때 발생합니다. 출력 제한은 1MB 입니다.",
    "런타임 에러": "실행 도중에 'segmentation fault', 'floating point exception', 'used forbidden functions', 'tried to access forbidden memories' 등의 에러가 발생하여서 프로그램이 종료된 경우 입니다.",
    "컴파일 에러": "컴파일 하지 못한 경우입니다. Warning Message는 에러 메시지가 아닙니다. 채점 결과를 클릭하면 컴파일 에러 메시지를 볼 수 있습니다."
}
